# 450+ Practice Questions From Pandas, NumPy, and SQL.

Author: Avi Chawla

LinkedIn: https://www.linkedin.com/in/avi-chawla/

Read my blogs here: https://medium.com/@avi_chawla

## Introduction

This notebook has been created for you to practice three of the most common tools used in building any machine learning or data science applications, i.e., Pandas, NumPy, and SQL!

The practice questions provided will serve as a great resource for those who are looking to familiarize themselves with some of the most common functions used in these tools.

Appropriate descriptions have been provided for all the questions in this entire exercise which will help you navigate through this exercise easily. If a dataset is to be loaded in the python environment, that has also been provided for you. You can find it on the right panel in the Files section. Do NOT delete any of the files/folders listed there.

The whole exercise has been divided into nine separate notebooks. Below are the links to all the other notebooks for you to jump from one notebook to another:

- **Pandas**

1. Pandas Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/notebook/6449493c84734151b11f4b6871f045d2#99f75bf946d04b9bb1daa9e14c2cfea9) 
2. Pandas Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/notebook/notebook-0de50f3b70834570b13b651dde44c491) 

3. Pandas Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/notebook/notebook-78e3faf901da4f14881ef24e41c80bf6) 

4. Pandas Notebook 4: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/notebook/notebook-134ac20c38ef45e5a4432abd638e6c2e) 

- **NumPy**

1. NumPy Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Numpy-part-1-9b9979f2-b708-4292-b466-3d0157564c91/notebook/notebook-07232b5ebafe49b198a9c55c553414f1) 

2. NumPy Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-2-4456411e-2ddd-426d-8027-4881080027db/notebook/notebook-988aba30f33a45a3861adc4f6a6f338c)  

3. NumPy Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-3-e6587114-b580-4249-b599-540de859e603/notebook/notebook-bb52759ea3f542eaaed9958b5df9c34b)

- **SQL**

1. SQL Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-1-eac9d782-a9b1-4e84-a1f9-af14080a6121/notebook/notebook-697f04297c664d02901db0f85431512e)  **(This Notebook)**

2. SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/notebook/notebook-e549236b988c42a5b53126a7ebb98127)

## How to use this notebook?

At the top right corner, you will find a Duplicate button. This will allow you to create a unique notebook for your own practice and write solutions to the question listed in this notebook.

If you face any issues or have any feedback, feel free to reach out to me (Avi Chawla) either on Linkedin: https://www.linkedin.com/in/avi-chawla/ or write an email to avi@dsscholar[dot]com.

Let's begin ðŸš€!

# SQL Notebook 1

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("employee_dataset.csv")
data.head()

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

To run SQL Queries, write your queries in the usual. The name of the dataframe will be treated as the table-name while writing these queries. A sample query is mentioned below:

### Sample Query

In [3]:
_dntk.execute_sql(
  'select * from data; -- select all rows and columns from the data. ',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
...,...,...,...,...,...,...,...,...
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770,Intern,3.3

### 1. Print the first five rows

In [4]:
_dntk.execute_sql(
  'Select * from data limit 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

### 2. Print the number of rows

In [5]:
_dntk.execute_sql(
  'SELECT COUNT(*) FROM data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0        300000

### 3. Print the first five rows of the Company_Name and Employment_Status Column

In [6]:
_dntk.execute_sql(
  'SELECT Company_Name, Employment_Status FROM data LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                   Company_Name Employment_Status
0                James and Sons         Full Time
1                 Nichols-James         Full Time
2                     Scott Inc         Full Time
3  Johnston, Fleming and Tanner         Full Time
4      Baker, Allen and Edwards         Full Time

### 4. Print the first five rows where the Employee_Rating > 4.5

In [7]:
_dntk.execute_sql(
  'select * from data where Employee_Rating>4.5 LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
1,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
2,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
3,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860,Full Time,4.8
4,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7

### 5. Print the number of rows having Employee_Salary > 600000

In [8]:
_dntk.execute_sql(
  'select COUNT(*) from data where Employee_Salary> 600000',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0        120013

### 6. Print the number of rows with Employee_Salary > 600000 and Employee_Rating > 4.5

In [9]:
_dntk.execute_sql(
  'select count(*) from data where Employee_Salary>600000 and Employee_Rating>4.5',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         10766

###  7. Print the first five rows with Employee_Salary > 600000 and Employee_Rating > 4.5

In [10]:
_dntk.execute_sql(
  'select * from data where Employee_Salary>600000 and Employee_Rating>4.5 LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
1,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
2,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7
3,Jonathan Armstrong,Scott Inc,Trading standards officer,Aliciafort,San Marino,902300,Full Time,4.8
4,Lori Smith,Thomas-Spencer,Optometrist,New Cindychester,Venezuela,687310,Full Time,4.8

### 8. Print all the distinct companies in the dataset

In [11]:
_dntk.execute_sql(
  'select DISTINCT(Company_Name) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                      Company_Name
0                 Bullock-Carrillo
1   Campos, Reynolds and Mccormick
2         Baker, Allen and Edwards
3                     Matthews Inc
4                Marshall-Holloway
5                   James and Sons
6                      Andrade LLC
7       Wallace, Smith and Shepard
8                        Nelson-Li
9     Johnston, Fleming and Tanner
10                  Thomas-Spencer
11                   Nichols-James
12                    Taylor-Ramos
13         White, Mcclain and Cobb
14                       Scott Inc

### 9. Print the number of distinct companies in the dataset

In [12]:
_dntk.execute_sql(
  'select COUNT(DISTINCT(Company_Name)) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count(DISTINCT Company_Name)
0                            15

### 10. Print all the distinct companies, city pairs in the dataset

In [13]:
_dntk.execute_sql(
  'SELECT DISTINCT Company_Name,Employee_City from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                     Company_Name      Employee_City
0                  James and Sons     New Russellton
1                   Nichols-James  North Melissafurt
2    Johnston, Fleming and Tanner     West Jamesview
3                     Andrade LLC       Ricardomouth
4                    Matthews Inc        Kristaburgh
..                            ...                ...
145                     Nelson-Li       Ricardomouth
146                     Nelson-Li  North Melissafurt
147                 Nichols-James          Whiteside
148  Johnston, Fleming and Tanner     New Russellton
149                James and Sons       Whitakerbury

[150 rows x 2 columns]

### 11. Print the number of distinct companies, city pairs in the dataset

In [14]:
_dntk.execute_sql(
  'SELECT COUNT(*) AS distinct_pairs\nFROM (SELECT DISTINCT Company_Name, Employee_City FROM data)',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   distinct_pairs
0             150

### 12. Print the number of Full time employees in the dataset.

In [15]:
_dntk.execute_sql(
  'select count(*) from data where Employment_Status = \'Full Time\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0        240010

### 13. Print the number of employees with job title either 'Production engineer' or 'New Russellton'.

In [16]:
_dntk.execute_sql(
  'select count(*) from data where Employee_Job_Title = \'Production engineer\' or Employee_City = \'New Russellton\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         43496

### 14. Print the number of employees with job title either 'Production engineer' and company name 'Scott Inc'

In [17]:
_dntk.execute_sql(
  'SELECT COUNT(*) from data where Employee_Job_Title=\'Production engineer\' and Company_Name = \'Scott Inc\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0          1036

### 15. Print the number of employees with job title either 'Production engineer' or 'New Russellton' and company name either 'Scott Inc' or 'Baker, Allen and Edwards'.

In [18]:
_dntk.execute_sql(
  'SELECT COUNT(*) from data where Employee_Job_Title=\'Production engineer\' and (Company_Name = \'Scott Inc\' or Company_Name=\'Baker, Allen and Edwards\');',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0          2062

### 16. Print the number of distinct cities with employees having job title either 'Production engineer' or 'New Russellton' and company name either 'Scott Inc' or 'Baker, Allen and Edwards'.

In [59]:
_dntk.execute_sql(
  'SELECT COUNT(Distinct Employee_City) from data WHERE Employee_Job_Title=\'Production engineer\' and Company_Name IN(\'Scott Inc\', \'Baker, Allen and Edwards\');',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count(DISTINCT Employee_City)
0                             10

### 17. Print the number of Intern employees in the dataset.

In [4]:
_dntk.execute_sql(
  'SELECT COUNT(*) FROM data where Employment_Status=\'Intern\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         59990

### 18. Print the number of employees with first name 'Matthew'.

In [6]:
_dntk.execute_sql(
  'SELECT COUNT(*) FROM data where Name LIKE \'Matthew%\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0          3063

### 19. Print the first five rows corresponding to the employees with highest salary

In [10]:
_dntk.execute_sql(
  'SELECT * from data order by Employee_Salary desc LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0
1,Jason Jenkins,Taylor-Ramos,Sales promotion account executive,Aliciafort,Pakistan,999980,Full Time,2.6
2,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980,Full Time,2.0
3,Richard Kennedy,Thomas-Spencer,Energy manager,Aliciafort,Cook Islands,999980,Full Time,2.4
4,Dennis Sexton,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,Kristaburgh,United Kingdom,999970,Full Time,0.9

### 20. Print the first five rows corresponding to the employees with the highest salary in 'James and Sons' company

In [12]:
_dntk.execute_sql(
  'SELECT * from data WHERE Company_Name=\'James and Sons\' order by Employee_Salary desc LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Jared Rice,James and Sons,Naval architect,New Russellton,Saint Barthelemy,999960,Full Time,2.6
1,Jamie Parks,James and Sons,Trading standards officer,Ricardomouth,Botswana,999860,Full Time,4.8
2,Shannon Harrison,James and Sons,Optometrist,Aliciafort,Austria,999830,Full Time,0.9
3,Angela Baker,James and Sons,"Radiographer, therapeutic",New Cindychester,Uruguay,999790,Intern,3.6
4,Jessica Nixon,James and Sons,Ergonomist,New Russellton,Korea,999770,Intern,2.7

### 21. Print the first five rows corresponding to the employees with the highest salary working either in 'James and Sons' company or living in 'Wardfort' city

In [14]:
_dntk.execute_sql(
  'SELECT * from data WHERE Company_Name=\'James and Sons\' or Employee_City= \'Wardfort\' order by Employee_Salary desc LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980,Full Time,2.0
1,Jared Rice,James and Sons,Naval architect,New Russellton,Saint Barthelemy,999960,Full Time,2.6
2,Carolyn Lucas,Bullock-Carrillo,Actuary,Wardfort,Fiji,999930,Full Time,1.9
3,Mia Howard,Nelson-Li,Actuary,Wardfort,Turks and Caicos Islands,999920,Full Time,2.5
4,Anthony Anderson,"Johnston, Fleming and Tanner",Diplomatic Services operational officer,Wardfort,Bangladesh,999910,Full Time,1.9

### 22. Print the total number of distinct records in the data.

In [21]:
_dntk.execute_sql(
  'SELECT COUNT(DISTINCT(Name,Company_Name,Employee_Rating)) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0        300000

### 23. Print the mean salary of all the employees in the data

In [27]:
_dntk.execute_sql(
  'SELECT avg(Employee_Salary) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   avg(Employee_Salary)
0         500224.207727

### 24. Print the mean rating of all the employees in the data

In [29]:
_dntk.execute_sql(
  'SELECT avg(Employee_Rating) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   avg(Employee_Rating)
0              2.505955

### 25-27. Print the maximum, minimum and median Employee_Salary.

In [31]:
_dntk.execute_sql(
  'SELECT MAX(Employee_Salary) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   max(Employee_Salary)
0                999990

In [33]:
df_1 = _dntk.execute_sql(
  'SELECT MIN(Employee_Salary) from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)
df_1

   min(Employee_Salary)
0                     0

In [37]:
df_2 = _dntk.execute_sql(
  'WITH rankedsalaries as(\n    SELECT Employee_Salary, \n    ROW_NUMBER() OVER (ORDER BY Employee_Salary) AS ROWASC,\n    ROW_NUMBER() OVER (ORDER BY Employee_Salary DESC) AS ROWDESC,\n    from data\n)\nSELECT avg(Employee_Salary) as Median from rankedsalaries where ROWASC=ROWDESC OR ROWASC+1=ROWDESC;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)
df_2

     Median
0  500780.0

### 28-32. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [39]:
_dntk.execute_sql(
  'SELECT Company_Name, COUNT(*) FROM data GROUP BY Company_Name;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                      Company_Name  count_star()
0                 Bullock-Carrillo         20063
1   Campos, Reynolds and Mccormick         19927
2         Baker, Allen and Edwards         20084
3                     Matthews Inc         20083
4                Marshall-Holloway         19859
5                   James and Sons         19868
6                      Andrade LLC         19983
7       Wallace, Smith and Shepard         19364
8                        Nelson-Li         20132
9     Johnston, Fleming and Tanner         19811
10                  Thomas-Spencer         20142
11                   Nichols-James         19911
12                    Taylor-Ramos         20122
13         White, Mcclain and Cobb         20261
14                       Scott Inc         20390

2. Employee_Job_Title

In [41]:
_dntk.execute_sql(
  'SELECT Employee_Job_Title, COUNT(*) FROM data GROUP BY Employee_Job_Title;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                                   Employee_Job_Title  count_star()
0                                     Equities trader         15000
1             Diplomatic Services operational officer         30137
2                                 Production engineer         15003
3                                     Naval architect         14905
4                           Radiographer, therapeutic         14882
5                                          Ergonomist         15006
6                        Investment banker, corporate         15008
7                                     Patent examiner         15085
8                                             Actuary         15030
9   Armed forces logistics/support/administrative ...         15050
10                                      Administrator         15222
11                                        Optometrist         14838
12                                     Energy manager         15033
13                         Regulatory affairs officer         14869
14                                               Make         14741
15                       Garment/textile technologist         15183
16                  Sales promotion account executive         14820
17                          Trading standards officer         15155
18                                Retail merchandiser         15033

3. Employee_City

In [43]:
_dntk.execute_sql(
  'SELECT Employee_City, COUNT(*) FROM data GROUP BY Employee_City;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

       Employee_City  count_star()
0           Wardfort         30097
1     West Jamesview         29941
2          Whiteside         29849
3        Kristaburgh         30204
4   New Cindychester         29756
5       Whitakerbury         29854
6         Aliciafort         30037
7     New Russellton         30001
8  North Melissafurt         30209
9       Ricardomouth         30052

4. Employee_Country

In [45]:
_dntk.execute_sql(
  'SELECT Employee_Country, COUNT(*) FROM data GROUP BY Employee_Country;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

          Employee_Country  count_star()
0    Palestinian Territory          1201
1         Marshall Islands          1293
2     Syrian Arab Republic          1200
3                 Dominica          1284
4                     Mali          1241
..                     ...           ...
238              Swaziland          1186
239                  Qatar          1232
240                Vietnam          1180
241               Cameroon          1234
242           Turkmenistan          1215

[243 rows x 2 columns]

5. Employment_Status

In [47]:
_dntk.execute_sql(
  'SELECT Employment_Status, COUNT(*) FROM data GROUP BY Employment_Status;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

  Employment_Status  count_star()
0         Full Time        240010
1            Intern         59990

### 33. Print the company with the most number of employees.

In [51]:
_dntk.execute_sql(
  'SELECT Company_Name, Count(*) AS Employees from data GROUP BY Company_Name ORDER BY Employees desc LIMIT 1;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

  Company_Name  Employees
0    Scott Inc      20390

### 34. Print the number of employees in the above company.

In [53]:
_dntk.execute_sql(
  'SELECT COUNT(*) FROM data where Company_Name=\'Scott Inc\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         20390

### 35. Print the company with the least number of employees.

In [55]:
_dntk.execute_sql(
  'SELECT Company_Name from data GROUP BY Company_Name ORDER BY count(*) LIMIT 1;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                 Company_Name
0  Wallace, Smith and Shepard

### 36. Print the number of employees in the above company.

In [57]:
_dntk.execute_sql(
  'SELECT count(*) from data WHERE Company_Name = \'Wallace, Smith and Shepard\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         19364

### 37. Print the employee details with the maximum salary

In [71]:
_dntk.execute_sql(
  '-- SELECT * FROM data ORDER BY Employee_Salary DESC LIMIT 1;\n\nSELECT * FROM data WHERE Employee_Salary = (select MAX(Employee_Salary) from data);',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0

### 38. Print the employee details with the maximum rating

In [69]:
_dntk.execute_sql(
  '-- SELECT * FROM data ORDER BY Employee_Rating desc LIMIT 1;\nSELECT *\nFROM data\nWHERE Employee_Rating = (SELECT MAX(Employee_Rating) FROM data);',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Joshua Huffman,James and Sons,Garment/textile technologist,New Russellton,Cook Islands,694760,Full Time,5.0
1,Alan Carlson,"Baker, Allen and Edwards",Diplomatic Services operational officer,Kristaburgh,Mongolia,491710,Intern,5.0
2,Lisa Summers,"Johnston, Fleming and Tanner",Regulatory affairs officer,North Melissafurt,Togo,933500,Full Time,5.0
3,Timothy Woods,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,United States Virgin Islands,367630,Full Time,5.0
4,Cameron Hawkins,Taylor-Ramos,Armed forces logistics/support/administrative ...,Wardfort,Tanzania,66570,Intern,5.0
...,...,...,...,...,...,...,...,...
2980,Michael Jordan,"Johnston, Fleming and Tanner",Naval architect,Whitakerbury,Philippines,474540,Full Time,5.0
2981,Rebecca Garrison,Nelson-Li,Production engineer,Whitakerbury,Ireland,592530,Full Time,5.0
2982,Daniel Jones,Taylor-Ramos,Sales promotion account executive,Kristaburgh,Sierra Leone,32160,Full Time,5.0
2983,Justin Mendez,Bullock-Carrillo,Regulatory affairs officer,New Cindychester,Colombia,374540,Full Time,5.0
2984,Doris Miller,Andrade LLC,Armed forces logistics/support/administrative ...,Wardfort,Kazakhstan,943340,Intern,5.0

### 39. Print the Company_Name with most number of employees in 'Wardfort' city.

In [75]:
_dntk.execute_sql(
  'SELECT Company_Name from data WHERE Employee_City=\'Wardfort\' GROUP BY Company_Name ORDER BY count(*) desc LIMIT 1;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

              Company_Name
0  White, Mcclain and Cobb

### 40. Print 'Employee_Salary' column as string.

In [83]:
_dntk.execute_sql(
  'SELECT CAST(Employee_Salary as CHAR) AS Employee_Salary_STR from data;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

       Employee_Salary_STR
0                   321520
1                   589090
2                   630890
3                   116400
4                   523499
...                    ...
299995               99670
299996              949580
299997              802830
299998              257240
299999              575770

[300000 rows x 1 columns]

### 41. Print the Employee_City with the most number of 'Production engineer'.

In [87]:
_dntk.execute_sql(
  'SELECT Employee_City,count(*) from data WHERE Employee_Job_Title = \'Production engineer\' \nGROUP BY Employee_City ORDER BY count(*) desc LIMIT 1;\n\n-- alternate query\n-- SELECT Employee_City, COUNT(*) AS CityCount\n-- FROM data\n-- WHERE Employee_Job_Title = \'Production engineer\'\n-- GROUP BY Employee_City\n-- HAVING COUNT(*) = (\n--     SELECT MAX(COUNT(*))\n--     FROM data\n--     WHERE Employee_Job_Title = \'Production engineer\'\n--     GROUP BY Employee_City\n-- );',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

  Employee_City  count_star()
0    Aliciafort          1588

### 42. Print the Company_Name with the most number of Full-time Employees.

In [108]:
_dntk.execute_sql(
  'SELECT Company_Name,COUNT(*) AS FTE from data \nWhere Employment_Status = \'Full Time\' \nGROUP BY Company_Name\nORDER BY FTE DESC LIMIT 1;\n',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

  Company_Name    FTE
0    Scott Inc  16396

### 43. Print the Company_Name with the highest average 'Employee_Rating'.

In [137]:
_dntk.execute_sql(
  'WITH MaxAvg AS (\n    SELECT MAX(avg_rating) AS max_avg_rating\n    FROM (\n        SELECT AVG(Employee_Rating) AS avg_rating\n        FROM data\n        GROUP BY Company_Name\n    ) AS subquery\n)\nSELECT Company_Name, AVG(Employee_Rating) AS average\nFROM data\nGROUP BY Company_Name\nHAVING AVG(Employee_Rating) = (SELECT max_avg_rating FROM MaxAvg);\n',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   Company_Name   average
0  Matthews Inc  2.525454

### 44. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

In [3]:
_dntk.execute_sql(
  'SELECT COUNT(*) from data WHERE Employee_City IN (\'Ricardomouth\',\'Kristaburgh\');',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         60256

### 45. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

In [21]:
_dntk.execute_sql(
  'SELECT DISTINCT(Company_Name), Employee_Salary\nfrom (\n    SELECT Company_Name, Employee_Salary, DENSE_RANK() OVER(ORDER BY Employee_Salary DESC) as rnk\n    from data\n) ranked\nwhere rnk==5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

                 Company_Name  Employee_Salary
0  Wallace, Smith and Shepard           999950
1                   Scott Inc           999950
2               Nichols-James           999950
3    Baker, Allen and Edwards           999950

### 46. Check if any of the columns has NULL values.

In [4]:
_dntk.execute_sql(
  'SELECT * FROM data WHERE Name IS NULL OR Company_Name IS NULL; # and so on',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

Empty DataFrame
Columns: [Name, Company_Name, Employee_Job_Title, Employee_City, Employee_Country, Employee_Salary, Employment_Status, Employee_Rating]
Index: []

### 47. Print the data type of every column in the data.

In [14]:
_dntk.execute_sql(
  '',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

### 48. Print the number of employees with Employee_Rating greater than the average Employee_Rating

In [18]:
_dntk.execute_sql(
  'SELECT COUNT(*) FROM data WHERE Employee_Rating>(SELECT AVG(Employee_Rating) from data);',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0        147548

### 49. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

In [24]:
_dntk.execute_sql(
  '(SELECT * FROM data WHERE Employee_Rating=(SELECT MIN(Employee_Rating) from data) ORDER BY Employee_Salary DESC LIMIT 1);',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Austin Poole,"White, Mcclain and Cobb",Administrator,Whiteside,Saint Kitts and Nevis,999690,Intern,0.0

### 50. Sort the table in ascending order of Employee_Salary

In [26]:
_dntk.execute_sql(
  'SELECT * FROM data ORDER BY Employee_Salary;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Kristen Vasquez,"White, Mcclain and Cobb",Armed forces logistics/support/administrative ...,Wardfort,Bermuda,0,Full Time,3.4
1,Courtney Singleton,"White, Mcclain and Cobb",Garment/textile technologist,New Cindychester,Ethiopia,0,Full Time,2.8
2,Vanessa Wu,"Campos, Reynolds and Mccormick",Patent examiner,North Melissafurt,Zambia,10,Full Time,1.3
3,Penny Meza,"Wallace, Smith and Shepard",Trading standards officer,Wardfort,Albania,10,Full Time,0.7
4,Grace Smith,"Johnston, Fleming and Tanner",Trading standards officer,West Jamesview,Libyan Arab Jamahiriya,10,Intern,1.1
...,...,...,...,...,...,...,...,...
299995,Dennis Sexton,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,Kristaburgh,United Kingdom,999970,Full Time,0.9
299996,Jason Jenkins,Taylor-Ramos,Sales promotion account executive,Aliciafort,Pakistan,999980,Full Time,2.6
299997,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980,Full Time,2.0
299998,Richard Kennedy,Thomas-Spencer,Energy manager,Aliciafort,Cook Islands,999980,Full Time,2.4
299999,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0

### 51. Sort the table in descending order of Employee_Rating

In [30]:
_dntk.execute_sql(
  'SELECT * FROM data ORDER BY Employee_Rating DESC;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Joshua Huffman,James and Sons,Garment/textile technologist,New Russellton,Cook Islands,694760,Full Time,5.0
1,Alan Carlson,"Baker, Allen and Edwards",Diplomatic Services operational officer,Kristaburgh,Mongolia,491710,Intern,5.0
2,Lisa Summers,"Johnston, Fleming and Tanner",Regulatory affairs officer,North Melissafurt,Togo,933500,Full Time,5.0
3,Timothy Woods,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,United States Virgin Islands,367630,Full Time,5.0
4,Cameron Hawkins,Taylor-Ramos,Armed forces logistics/support/administrative ...,Wardfort,Tanzania,66570,Intern,5.0
...,...,...,...,...,...,...,...,...
299995,Rebecca Mason,Nichols-James,Make,West Jamesview,Israel,106710,Intern,0.0
299996,Todd Mccormick,Taylor-Ramos,Diplomatic Services operational officer,West Jamesview,Costa Rica,334730,Full Time,0.0
299997,Kevin Mckenzie,Nichols-James,Diplomatic Services operational officer,Whitakerbury,Portugal,306210,Full Time,0.0
299998,Michael Hall,Matthews Inc,Make,New Cindychester,Turkey,978230,Full Time,0.0
299999,Thomas Gibson,"Wallace, Smith and Shepard",Diplomatic Services operational officer,New Cindychester,Malawi,706300,Full Time,0.0

### 52. Print the name of 100th employee after sorting on Name column

In [34]:
_dntk.execute_sql(
  'SELECT * FROM data ORDER BY Name LIMIT 1 OFFSET 99;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Aaron Brown,Marshall-Holloway,Energy manager,Kristaburgh,Iran,75530,Full Time,3.0

### 53. Print the first 5 rows of the first 5 columns.

In [36]:
_dntk.execute_sql(
  'SELECT Name, Company_Name, Employee_Job_Title, Employee_City, Employee_Salary FROM data LIMIT 5;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Salary
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,321520
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,589090
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,630890
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,116400
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,523499

### 54. Print the number of employees whose first name starts with the letter 'V'.

In [38]:
_dntk.execute_sql(
  'SELECT * FROM data WHERE Name LIKE \'V%\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Vanessa Allen,Andrade LLC,Make,Ricardomouth,Mali,850140,Full Time,2.6
1,Vicki Beard,Matthews Inc,Diplomatic Services operational officer,Kristaburgh,Western Sahara,777000,Full Time,3.3
2,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
3,Victor Miller,Thomas-Spencer,Patent examiner,New Russellton,France,560730,Full Time,3.1
4,Victor Sandoval,Taylor-Ramos,Diplomatic Services operational officer,Kristaburgh,Cote d'Ivoire,819610,Intern,0.5
...,...,...,...,...,...,...,...,...
3678,Valerie Graham,Andrade LLC,Garment/textile technologist,Wardfort,Saint Lucia,430100,Intern,4.0
3679,Valerie Martin,Thomas-Spencer,Equities trader,Kristaburgh,Bahrain,643170,Full Time,2.3
3680,Victoria Garcia,"Baker, Allen and Edwards","Radiographer, therapeutic",Aliciafort,Bolivia,197000,Full Time,2.2
3681,Vincent Werner,"Baker, Allen and Edwards",Diplomatic Services operational officer,Whitakerbury,Netherlands,132330,Full Time,2.9
3682,Vicki Stephenson,Nichols-James,Administrator,New Russellton,Lebanon,910560,Full Time,1.6

### 55. Print the number of employees whose last name starts with the letter 'R'.

In [44]:
_dntk.execute_sql(
  'SELECT COUNT(*) FROM data WHERE SPLIT_PART(Name, \' \', -1) LIKE \'R%\';',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

   count_star()
0         20712

### 56. Select the rows 2 to 7 and the columns 3 to 7 (both included)

In [50]:
_dntk.execute_sql(
  'select * from data limit 6 offset 1;',
  'SQL_DEEPNOTE_DATAFRAME_SQL',
  audit_sql_comment='',
  sql_cache_mode='cache_disabled',
  return_variable_type='dataframe'
)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
1,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
2,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
3,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
4,Vanessa Allen,Andrade LLC,Make,Ricardomouth,Mali,850140,Full Time,2.6
5,Kelly Brown,Andrade LLC,Naval architect,Wardfort,Aruba,711410,Full Time,2.0

Great job solving this notebook. Go to SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/%2Fnotebook.ipynb)